[
{"title": "Elon Musk's SpaceX fined for worker-safety violation, employee suffered 'near amputation': report", "text": "SpaceX was fined $3,600 by Washington state worker safety officials after a workplace accident led to a \"near amputation\" for one employee.", "time": "February 14", "category": "Technology", "link": "/technology/elon-musks-spacex-fined-worker-safety-violation-employee-suffered-near-amputation-report"},
{"title": "Chernobyl’s mutant wolves developing resistance to cancer, study says", "text": "Wolves in Chernobyl’s radiation zone appear to have adapted to the highly radioactive environment and appear resiliant against cancer, a study says.", "time": "February 11", "category": "Lifestyle", "link": "/lifestyle/chernobyls-mutant-wolves-developing-resistance-to-cancer-study-says"},
{"title": "Airline plans to weigh passengers with carry-on luggage before take-off", "text": "Finnish airline Finnair announced the move, which it stressed is voluntary and anonymous, as a way to get a better estimate of a plane's weight before takeoff", "time": "February 7", "category": "Media", "link": "/media/airline-plans-weigh-passengers-luggage-take-off"},
{"title": "Health experts raise concerns over AI apps claiming to be pocket nutrition assistants", "text": "Dietitian-nutritionist Alexandra Kaplan discussed the implications A.I. could have in the nutrition industry if the technology secures a solid role in helping people stay healthy.", "time": "February 4", "category": "Media", "link": "/media/health-experts-raise-concerns-ai-apps-claiming-pocket-nutrition-assistants"},
{"title": "CDC concerned with spike in illnesses linked to some tianeptine products", "text": "The Centers for Disease Control and Prevention warned an \"uncharacteristic spike\" of illnesses in New Jersey has tied to products that contain the drug tianeptine.", "time": "February 2", "category": "Lifestyle", "link": "/lifestyle/cdc-concerned-spike-illnesses-linked-some-tianeptine-products"},
{"title": "Connecticut Gov Lamont says state will be 1st to cancel medical debt for all eligible residents", "text": "Connecticut Gov. Ned Lamont announced his state would become the first to erase or eliminate medical debt for all eligible residents.", "time": "February 2", "category": "Politics", "link": "/politics/connecticut-gov-lamont-state-first-cancel-medical-debt-all-eligible-residents"},
{"title": "Novo Nordisk increasing supply of Wegovy as demand continues to grow", "text": "Novo Nordisk says it Is gradually ramping up supply of its sought-after drug Wegovy. However, the company is still warning patients demand will still outpace supply overall.", "time": "January 31", "category": "Lifestyle", "link": "/lifestyle/novo-nordisk-increasing-supply-wegovy-demand-continues-grow"},
{"title": "Over 100 cruise passengers sickened after gastrointestinal illness outbreak", "text": "The Centers for Disease Control and Prevention said 120 guests have become sick while sailing on the Queen Victoria luxury liner owned by Cunard Cruise Line.", "time": "January 31", "category": "Lifestyle", "link": "/lifestyle/over-100-cruise-passengers-sickened-after-gastrointestinal-illness-outbreak"},
{"title": "Stew Leonard’s recalls cookies after woman, 25, dies from eating product that ‘contained undeclared peanuts'", "text": "Stew Leonard’s has issued a cookie recall after Connecticut health officials say they “contained undeclared peanuts\" and are linked to a woman’s death.", "time": "January 25", "category": "Lifestyle", "link": "/lifestyle/stew-leonards-recalls-cookies-woman-25-dies-eating-product-contained-undeclared-peanuts"},
{"title": "Robitussin cough syrups recalled due to 'microbial contamination,' maker says", "text": "Two types and sizes of Robitussin cough syrup have been recalled, its maker announced Wednesday through the U.S. Food and Drug Administration, due to \"microbial contamination.\"", "time": "January 25", "category": "Economy", "link": "/economy/robitussin-cough-syrups-recalled-microbial-contamination-maker-says"},
{"title": "Third lawsuit against Panera claims caffeinated 'Charged Lemonade' caused 'permanent cardiac injuries'", "text": "A third lawsuit was filed against Panera Bread this week, involving its caffeinated \"Charged Lemonade,\" which allegedly cause a woman to have heart palpitations and \"permanent cardiac injuries.\"", "time": "January 18", "category": "Markets", "link": "/markets/third-lawsuit-against-panera-claims-caffeinated-charged-lemonade-caused-permanent-cardiac-injuries"},
{"title": "Quaker Oats expands recall of certain products over salmonella risk", "text": "The Quaker Oats Company has expanded a product recall for certain varieties of its popular granola bars and cereals due to possible salmonella contamination.", "time": "January 13", "category": "Health", "link": "/fox-news-health/quaker-oats-expands-recall-certain-products-salmonella-risk"},
{"title": "NFL legends Brian Dawkins, Patrick Willis using Nirvana Super's innovative beverages to stay fit post-career", "text": "Brian Dawkins and Patrick Willis still look like they can play in the NFL today because they're staying on top of their fitness goals. Nirvana Super is helping them do so.", "time": "January 4", "category": "Sports", "link": "/sports/nfl-legends-brian-dawkins-patrick-willis-using-nirvana-supers-innovative-beverages-stay-fit-post-career"},
{"title": "Ice cream brand offering $5K endorsement deal to those who keep New Year’s resolutions", "text": "Halo Top Ice Cream announced a new endorsement deal up for grabs to anyone who is willing to stick with a New Year's resolution goal — see how you can win.", "time": "January 3", "category": "Lifestyle", "link": "/lifestyle/ice-cream-brand-offering-5k-endorsement-deal-keep-new-years-resolution"},
{"title": "With popular asthma inhaler now discontinued, what other options do patients have?", "text": "Glaxo Smith Kline (GSK) announced in May that Flovent HFA, a metered-dose inhaler, as well as Flovent Diskus, a dry powder inhaler, would be discontinued as of Dec. 31, 2023. Experts weigh in.", "time": "January 3", "category": "Health", "link": "/fox-news-health/popular-asthma-inhaler-discontinued-what-options-do-patients-have"},
{"title": "RXBAR offers cash reward for customers willing to move their couch for New Year's challenge", "text": "RXBAR is encouraging customers to move their couches for New Year's, offering them a chance at $2,500 to be used for fitness equipment.", "time": "January 1", "category": "Lifestyle", "link": "/lifestyle/rxbar-offers-cash-reward-customers-willing-move-their-couch-new-years-challenge"},
{"title": "MIT study looks at new vibrating pill as innovative weight-loss treatment", "text": "Tricking stomachs into thinking they are full is the idea behind a potential weight-loss treatment, with a vibrating capsule showing promise in animals.", "time": "December 27", "category": "Lifestyle", "link": "/lifestyle/mit-study-looks-new-vibrating-pill-innovative-weight-loss-treatment"},
{"title": "Ozempic, Wegovy and other weight loss drugs present holiday challenges", "text": "Holiday prep may include forgoing doses for some people taking medications popularly used to facilitate weight loss. Those who do that need to be careful when resuming them, an expert said.", "time": "December 22", "category": "Lifestyle", "link": "/lifestyle/ozempic-wegovy-weight-loss-drugs-holidays"},
{"title": "Hungry families in Missouri wait hours in the cold for meals at overwhelmed food giveaway: 'The need is real'", "text": "Missouri families lined up with their cars hours before a food giveaway was scheduled to begin Tuesday morning and organizers quickly ran out of food.", "time": "December 13", "category": "Economy", "link": "/economy/hungry-families-missouri-wait-hours-cold-meals-overwhelmed-food-giveaway-the-need-is-real"},
{"title": "Southwest Airlines celebrated for policy to give a full row to 'passengers of size' for free", "text": "TikTokers have recently discovered Southwest Airlines' inclusion policy to provide one or two additional seats to 'passengers of size' at no extra cost.", "time": "December 13", "category": "Media", "link": "/media/southwest-airlines-celebrated-policy-give-full-row-passengers-free"}
]